theficus/MousrLib/arduino/Esp32Mousr/include/main.h
#pragma once
#ifndef MOUSR_MAIN_H
#define MOUSR_MAIN_H

#include "logging.h"
#include "utility.h"

#ifdef ARDUINO
#ifdef ARDUINO_ARCH_ESP32
#include "esp32-hal-log.h"
#include "Wire.h"
#endif // ARDUINO_ARCH_ESP32

#ifdef _DO_BLE
#include "Mousr.h"
#include "MousrBluetooth.h"

void waitForStatus(MousrConnectionStatus);
static void onBluetoothStatusChange(MousrConnectionStatus oldStatus, MousrConnectionStatus newStatus);
static void onBluetoothNotify(BLERemoteCharacteristic *characteristic, MousrData &data);

#endif // _DO_BLE

#ifdef _DO_SS
#include "controller.h"
#include "buttons.h"
#include "analog.h"

#ifndef JOYSTICK_INT_PIN
#define JOYSTICK_INT_PIN 32 // Interrupt pin
#endif                      // JOYSTICK_INT_PIN

#define DRIFT_U 20
#define DRIFT_D 20
#define DRIFT_L 55
#define DRIFT_R 50

void onButtonPressChangeTask(void *);
void onAnalogStickChangeTask(void *);
void onButtonPressStateChange(ButtonStateChange state);
void onAnalogStickChange(AnalogStickMovement prev, AnalogStickMovement cur);

#endif // _DO_SS

#ifdef _DO_OLED
#include "Oled.h"
#endif // _DO_OLED

#include "utility.h"

#endif // ARDUINO
#endif // MOUSR_MAIN_H